<a href="https://colab.research.google.com/github/gabrielalastra/PYTHON/blob/master/analysis_cleaning1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

In [63]:
#criando uma serie
s1 = pd.Series([1,2,3,4,4,4,5,np.nan, np.nan, 4])

In [7]:
#tem algum elemento nulo
s1.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [8]:
#s1 eh NAN
s1.isna()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [9]:
#nao eh nulo
s1.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [11]:
#quais elementos sao NaN em s1
s1[pd.isna(s1)]

3   NaN
4   NaN
dtype: float64

In [12]:
#quais elementos nao sao NaN em s1
s1[pd.notnull(s1)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [29]:
#coluna com dados em falta
matrix = pd.DataFrame({
    'coluna A' : ['amor', 'abacate', np.nan],
    'coluna B' : ['beijo', np.nan, 2],
    'coluna C' : [np.nan, np.nan, 1000],
    'coluna D' : ['coraçao', 'carambola', 4]
})

matrix.info() #observe o Not-null count

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      object
 1   B       2 non-null      object
 2   C       1 non-null      float64
 3   D       3 non-null      object
dtypes: float64(1), object(3)
memory usage: 224.0+ bytes

In [30]:
matrix.isnull().sum()

A    1
B    1
C    2
D    0
dtype: int64

In [35]:
#mostra a coluna que nao falta nenhum dado
matrix.dropna(axis=1) #para mostrar a linha tira o axis ou coloca axis=0

           D
0    coraçao
1  carambola
2          4

In [38]:
#quantos dados nulos em cada coluna
matrix.isnull().sum()

A    1
B    1
C    2
D    0
dtype: int64

In [ ]:
#corte se tiver todos com NaN
matrix.dropna(how='all')

In [ ]:
matrix.dropna(how='any')

In [41]:
matrix

         A      B       C          D
0     amor  beijo     NaN    coraçao
1  abacate    NaN     NaN  carambola
2      NaN      2  1000.0          4

In [49]:
#minimo de nan nas linhas e colunas
matrix.dropna(thresh=3, axis=1) # com 3 fica a coluna que nao tem nenhum NaN

           D
0    coraçao
1  carambola
2          4

In [50]:
#preenchendo o NaN por zero
matrix.fillna(0)

         A      B       C          D
0     amor  beijo     0.0    coraçao
1  abacate      0     0.0  carambola
2        0      2  1000.0          4

In [64]:
#preenchendo com a media
print('preenchendo os NaN com a media \n {}'.format(s1.fillna(s1.mean())))
#preenchendo com a mediana
print('preenchendo os NaN com a mediana \n {}'.format(s1.fillna(s1.median())))
#preenchendo com a moda
print('preenchendo os NaN com a moda \n {}'. format(s1.fillna(s1.mode())))

preenchendo os NaN com a media
 0    1.000
1    2.000
2    3.000
3    4.000
4    4.000
5    4.000
6    5.000
7    3.375
8    3.375
9    4.000
dtype: float64
preenchendo os NaN com a mediana
 0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
6    5.0
7    4.0
8    4.0
9    4.0
dtype: float64
preenchendo os NaN com a moda
 0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
6    5.0
7    NaN
8    NaN
9    4.0
dtype: float64

In [71]:
moda = s1.mode()

In [ ]:
s1.fillna(moda)

In [ ]:
#preenche repetindo o numero anterior
s1.fillna(method='ffill')

In [77]:
#preenche repetindo o numero antecessor
s1.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
6    5.0
7    4.0
8    4.0
9    4.0
dtype: float64

In [78]:
matrix.fillna(method='ffill')

         A      B       C          D
0     amor  beijo     NaN    coraçao
1  abacate  beijo     NaN  carambola
2  abacate      2  1000.0          4

In [79]:
matrix.fillna(method='bfill')

         A      B       C          D
0     amor  beijo  1000.0    coraçao
1  abacate      2  1000.0  carambola
2      NaN      2  1000.0          4

In [80]:
matrix.fillna(method='ffill', axis=1) #preenchendo com a linha

         A        B        C          D
0     amor    beijo    beijo    coraçao
1  abacate  abacate  abacate  carambola
2      NaN        2     1000          4

In [83]:
matrix.fillna(method='bfill', axis=1)

         A          B          C          D
0     amor      beijo    coraçao    coraçao
1  abacate  carambola  carambola  carambola
2        2          2       1000          4

In [85]:
#verifique o tamanho com nan e com dropna
missing_values = len(s1.dropna()) !=len(s1)
missing_values

True

In [86]:
s1

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
6    5.0
7    NaN
8    NaN
9    4.0
dtype: float64

In [87]:
len(s1)

10

In [88]:
s1.dropna().count()

8

In [89]:
s1.count()

8

In [91]:
miss = s1.count() != len(s1)
miss

True

In [92]:
matrix.isnull().values.any()

True

In [93]:
matrix.isnull().values

array([[False, False,  True, False],
       [False,  True,  True, False],
       [ True, False, False, False]])